; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   blue_door_1 blue_door_2 blue_door_3 green_door_1 - door
   purple_box_1 grey_box_4 grey_box_1 grey_box_2 green_box_1 grey_box_3 - box
   green_ball_1 purple_ball_1 - ball
 )
 (:init (agentinroom room_2) (objectinroom grey_box_1 room_1) (objectinroom grey_box_2 room_2) (objectinroom grey_box_3 room_2) (objectinroom purple_box_1 room_3) (objectinroom green_ball_1 room_3) (objectinroom grey_box_4 room_3) (objectinroom purple_ball_1 room_4) (objectinroom green_box_1 room_4) (objectcolor grey_box_1 greytype) (objectcolor grey_box_2 greytype) (objectcolor grey_box_3 greytype) (objectcolor purple_box_1 purpletype) (objectcolor green_ball_1 greentype) (objectcolor grey_box_4 greytype) (objectcolor purple_ball_1 purpletype) (objectcolor green_box_1 greentype) (objectcolor blue_door_1 bluetype) (objectcolor blue_door_2 bluetype) (objectcolor blue_door_3 bluetype) (objectcolor green_door_1 greentype) (emptyhands) (locked blue_door_1) (locked blue_door_2) (locked blue_door_3) (locked green_door_1) (adjacentrooms room_2 room_1 blue_door_1) (adjacentrooms room_1 room_2 blue_door_1) (adjacentrooms room_3 room_1 blue_door_2) (adjacentrooms room_1 room_3 blue_door_2) (adjacentrooms room_4 room_2 blue_door_3) (adjacentrooms room_2 room_4 blue_door_3) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v purpletype) (objectinroom ?v room_4) (agentinroom room_4) (at_ ?v)))))
 (:constraints (sometime (at_ green_door_1)) (sometime (agentinroom room_4)) (sometime-before (agentinroom room_4) (or (agentinroom room_1) (carrying purple_ball_1))) (always (locked blue_door_3)) (sometime (at_ purple_ball_1)) (sometime-before (at_ purple_ball_1) (or (not (emptyhands)) (not (locked blue_door_2)))) (sometime (or (carrying purple_ball_1) (not (emptyhands)))))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor blue_door_1 room_2 room_1)
   added: (at_ blue_door_1)
   goals met: 0 of 1
2. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 0 of 1
3. (gotoroom room_2 room_1 blue_door_1)
   deleted: (agentinroom room_2) (at_ blue_door_1)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 1
4. (gotodoor blue_door_2 room_1 room_3)
   added: (at_ blue_door_2)
   goals met: 0 of 1
5. (toggle blue_door_2)
   deleted: (locked blue_door_2)
   goals met: 0 of 1
6. (gotoroom room_1 room_3 blue_door_2)
   deleted: (agentinroom room_1) (at_ blue_door_2)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
7. (gotodoor green_door_1 room_3 room_4)
   added: (at_ green_door_1)
   goals met: 0 of 1
8. (toggle green_door_1)
   deleted: (locked green_door_1)
   goals met: 0 of 1
9. (gotoobject green_ball_1 room_3)
   deleted: (at_ green_door_1)
   added: (at_ green_ball_1)
   goals met: 0 of 1
10. (pick green_ball_1 room_3)
   deleted: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_3)
   added: (carrying green_ball_1)
   goals met: 0 of 1
11. (gotoroom room_3 room_4 green_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 1
12. (gotoobject purple_ball_1 room_4)
   added: (at_ purple_ball_1)
   goals met: 1 of 1
